---
kind: type
id: T:Autodesk.Revit.DB.Structure.BendingDetailAngularDimensionsMeasurementOptions
source: html/b43ed982-270c-6a7b-ceaa-486265a1bcda.htm
---
# Autodesk.Revit.DB.Structure.BendingDetailAngularDimensionsMeasurementOptions

Describes the angular dimension measurement options.

## Syntax (C#)
```csharp
public enum BendingDetailAngularDimensionsMeasurementOptions
```